{
    "tid": 105344998,
    "publishdate": "1950-01-26",
    "title": "Article 19 in Constitution of India",
    "doc": "<h2 class=\"doc_title\">Article 19 in Constitution of India</h2>\n\n<section class=\"akn-section\" id=\"section_19\"><h3>19. Protection of certain rights regarding freedom of speech, etc.</h3>\n<section class=\"akn-subsection\" id=\"section_19.1\"><span class=\"akn-num\"><a href=\"/doc/1142233/\">(1)</a></span><span class=\"akn-intro\"><span class=\"akn-p\">All citizens shall have the right-</span></span><section class=\"akn-paragraph\" id=\"section_19.1.a\"><span class=\"akn-num\"><a href=\"/doc/1378441/\">(a)</a></span><span class=\"akn-content\"><span class=\"akn-p\">to freedom of speech and expression;</span><span class=\"akn-p\"><span class=\"akn-remark\" data-status=\"editorial\">[<b class=\"akn-b\">Editorial comment</b> -The Constitution (First Amendment) Act, 1951, made several changes to the Fundamental Rights Part of the Indian constitution where it amended Article 19(1)(a) of the Indian Constitution to counteract the \"abuse of freedom of speech and expression.\" This decision followed criticism in the press regarding the government's response to issues like the West Bengal refugee crisis and extrajudicial killings in Madras. Initial attempts to censor the press were ruled unconstitutional, leading the government to employ judicial decisions as justification for limiting freedom of speech. Despite opposition concerns about democratic principles, the Congress government proceeded with the amendment, citing international examples of regulating speech to prevent abuse. Important Verdicts: <a class=\"akn-ref\" data-eid=\"part_III__sec_19__subsec_1__para_a__p_2__ref_1\" data-href=\"https://indiankanoon.org/doc/43023\" href=\"https://indiankanoon.org/doc/43023\" id=\"part_III__sec_19__subsec_1__para_a__p_2__ref_1\">Brij Bhushan v State of Delhi, March 1950</a>, and <a class=\"akn-ref\" data-eid=\"part_III__sec_19__subsec_1__para_a__p_2__ref_2\" data-href=\"https://indiankanoon.org/doc/456839/\" href=\"https://indiankanoon.org/doc/456839/\" id=\"part_III__sec_19__subsec_1__para_a__p_2__ref_2\">Romesh Thappar v State of Madras, May 1950</a>. <a class=\"akn-ref\" data-eid=\"part_III__sec_19__subsec_1__para_a__p_2__ref_3\" data-href=\"https://en.wikipedia.org/wiki/First_Amendment_of_the_Constitution_of_India\" href=\"https://en.wikipedia.org/wiki/First_Amendment_of_the_Constitution_of_India\" id=\"part_III__sec_19__subsec_1__para_a__p_2__ref_3\">Also refer</a>]</span></span></span></section><section class=\"akn-paragraph\" id=\"section_19.1.b\"><span class=\"akn-num\"><a href=\"/doc/1248826/\">(b)</a></span><span class=\"akn-content\"><span class=\"akn-p\">to assemble peaceably and without arms;</span></span></section><section class=\"akn-paragraph\" id=\"section_19.1.c\"><span class=\"akn-num\"><a href=\"/doc/445304/\">(c)</a></span><span class=\"akn-content\"><span class=\"akn-p\">to form associations or unions or co-operative societies;</span></span></section><section class=\"akn-paragraph\" id=\"section_19.1.d\"><span class=\"akn-num\"><a href=\"/doc/1024002/\">(d)</a></span><span class=\"akn-content\"><span class=\"akn-p\">to move freely throughout the territory of India;</span></span></section><section class=\"akn-paragraph\" id=\"section_19.1.f\"><span class=\"akn-num\"><a href=\"/doc/258019/\">(f)</a></span><span class=\"akn-content\"><span class=\"akn-p\">sub-clause (f) shall be omitted;</span></span></section><section class=\"akn-paragraph\" id=\"section_19.1.e\"><span class=\"akn-num\"><a href=\"/doc/844404/\">(e)</a></span><span class=\"akn-content\"><span class=\"akn-p\">to reside and settle in any part of the territory of India;and</span></span></section><section class=\"akn-paragraph\" id=\"section_19.1.g\"><span class=\"akn-num\"><a href=\"/doc/935769/\">(g)</a></span><span class=\"akn-content\"><span class=\"akn-p\">to practise any profession, or to carry on any occupation, trade or business.</span></span></section></section><section class=\"akn-subsection\" id=\"section_19.2\"><span class=\"akn-num\"><a href=\"/doc/493243/\">(2)</a></span><span class=\"akn-content\"><span class=\"akn-p\">Nothing in sub-clause (a) of clause (1) shall affect the operation of any existing law, or prevent the State from making any law, in so far as such law imposes reasonable restrictions on the exercise of the right conferred by the said sub-clause in the interests ofthe sovereignty and integrity of India, the security of the State, friendly relations with Foreign States, public order, decency or morality or in relation to contempt of court, defamation or incitement to an offence.</span></span></section><section class=\"akn-subsection\" id=\"section_19.3\"><span class=\"akn-num\"><a href=\"/doc/1723400/\">(3)</a></span><span class=\"akn-content\"><span class=\"akn-p\">Nothing in sub-clause (b) of the said clause shall affect the operation of any existing law in so far as it imposes, or prevent the State from making any law imposing, in the interests ofthe sovereignty and integrity of India or public order, reasonable restrictions on the exercise of the right conferred by the said sub-clause.</span></span></section><section class=\"akn-subsection\" id=\"section_19.4\"><span class=\"akn-num\"><a href=\"/doc/1801956/\">(4)</a></span><span class=\"akn-content\"><span class=\"akn-p\">Nothing in sub-clause (c) of the said clause shall affect the operation of any existing law in so far as it imposes, or prevent the State from making any law imposing, in the interests ofthe sovereignty and integrity of India or public order or morality, reasonable restrictions on the exercise of the right conferred by the said sub-clause.</span></span></section><section class=\"akn-subsection\" id=\"section_19.5\"><span class=\"akn-num\"><a href=\"/doc/1801593/\">(5)</a></span><span class=\"akn-content\"><span class=\"akn-p\">Nothing in sub-clauses (d) and (e) of the said clause shall affect the operation of any existing law in so far as it imposes, or prevents the State from making any law imposing, reasonable restrictions on the exercise of any of the rights conferred by the said sub-clauses either in the interests of the general public or for the protection of the interests of any Scheduled Tribe.</span></span></section><section class=\"akn-subsection\" id=\"section_19.6\"><span class=\"akn-num\"><a href=\"/doc/626103/\">(6)</a></span><span class=\"akn-intro\"><span class=\"akn-p\">Nothing in sub-clause (g) of the said clause shall affect the operation of any existing law in so far as it imposes, or prevent the State from making any law imposing, in the interests of the general public, reasonable restrictions on the exercise of the right conferred by the said sub-clause, and, in particular, nothing in the said sub-clause shall affect the operation of any existing law in so far as it relates to, or prevent the State from making any law relating to,- <span class=\"akn-remark\" data-status=\"editorial\">[The following clause was substituted through Constitution (First Amendment) Act, 1951]</span></span><span class=\"akn-p\"><span class=\"akn-remark\" data-status=\"editorial\">[<b class=\"akn-b\">Editorial comment</b> -The Constitution (First Amendment) Act, 1951, made several changes to the Fundamental Rights Part of the Indian constitution.The privilege of Indian citizens to engage in any profession, occupation, trade, or business as granted by Article 19(1)(g) is constrained by reasonable restrictions that the State laws may impose \"in the interests of the general public.\" Although the mentioned words are inclusive enough to encompass any nationalization scheme, it was deemed necessary to eliminate ambiguity by introducing a clarifying addition to Article 19(6).<a class=\"akn-ref\" data-eid=\"part_III__sec_19__subsec_6__intro__p_2__ref_1\" data-href=\"https://en.wikipedia.org/wiki/First_Amendment_of_the_Constitution_of_India\" href=\"https://en.wikipedia.org/wiki/First_Amendment_of_the_Constitution_of_India\" id=\"part_III__sec_19__subsec_6__intro__p_2__ref_1\">Also refer</a>]</span></span></span><section class=\"akn-paragraph\" id=\"section_19.6.i\"><span class=\"akn-num\"><a href=\"/doc/1172678/\">(i)</a></span><span class=\"akn-content\"><span class=\"akn-p\">the professional or technical qualifications necessary for practising any profession or carrying on any occupation, trade or business, or</span></span></section><section class=\"akn-paragraph\" id=\"section_19.6.ii\"><span class=\"akn-num\"><a href=\"/doc/588489/\">(ii)</a></span><span class=\"akn-content\"><span class=\"akn-p\">the carrying on by the State, or by a corporation owned or controlled by the State, of any trade, business, industry or service, whether to the exclusion, complete or partial, of citizens or otherwise.</span></span></section></section><span class=\"akn-wrapUp\"><span class=\"akn-p\"><span class=\"akn-remark\" data-status=\"editorial\">[<b class=\"akn-b\">Editorial Comment</b> - <a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_1__ref_1\" data-href=\"https://indiankanoon.org/doc/1218090/\" href=\"https://indiankanoon.org/doc/1218090/\" id=\"part_III__sec_19__wrapup__p_1__ref_1\">Article 19(1)</a> of the Constitution of India guarantees six fundamental freedoms to every citizen of India. Though all of these six Fundamental Freedoms are not absolute. They contain certain restraints and exceptions within them which are postulated in Article 19(2) to 19(6). <br class=\"akn-br\"/><br class=\"akn-br\"/><b class=\"akn-b\">Freedom of Speech and Expression</b> - Article 19(1)(a) grants citizens the right to freely express their thoughts, opinions, and ideas. This includes the freedom to express oneself through speech, writing, printing, visual representations, or any other means. However, reasonable restrictions can be imposed on this right for the interests of sovereignty and integrity of India, security of the State, friendly relations with foreign nations, public order, decency or morality, contempt of court, defamation, incitement to an offense, or the sovereignty and integrity of Parliament.<br class=\"akn-br\"/><br class=\"akn-br\"/>The first set of grounds, namely, the sovereignty and integrity of India, the security of the State, friendly relations with foreign States and public order are all grounds referable to national interest. Whereas the second set of grounds, namely, decency or morality, contempt of court, defamation and incitement to an offense are all concerned with the interest of the society. However it is the constitutional obligation of the judiciary to ensure that the restrictions imposed by a law on the media are reasonable and relate to the purposes specified in Article 19(2).Because reasonable restrictions contemplated under the Indian Constitution brings the matter in the domain of the court as the question of reasonableness is a question primarily for the Court to decide. Freedom of speech and expression is a crucial right which is recognized by Article 19(l)(a), It has been held to be a basic and indivisible right for a democratic polity.<br class=\"akn-br\"/><br class=\"akn-br\"/>In <a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_1__ref_2\" data-href=\"https://indiankanoon.org/doc/456839/\" href=\"https://indiankanoon.org/doc/456839/\" id=\"part_III__sec_19__wrapup__p_1__ref_2\">Romesh Thappar v. State of Madras</a>  ,Patanjali Shastri, C.J. observed:“Freedom of speech and of the press lay at the foundation of all democratic organizations, for without free political discussion no public education, so essential for the proper functioning of the process of popular government, is possible”The expression ‘Freedom of press’ is part of the ambit of article 19 and it means the right to print and publish without any interference from the state or any other public authority. But this Freedom, like other freedoms, cannot be absolute but is subject to well known exceptions acknowledged in the public interests, which in India are enumerated in Article 19(2) of the constitution.<br class=\"akn-br\"/><br class=\"akn-br\"/>Thus, in <a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_1__ref_3\" data-href=\"https://indiankanoon.org/doc/671310/\" href=\"https://indiankanoon.org/doc/671310/\" id=\"part_III__sec_19__wrapup__p_1__ref_3\">Prabhu Dutt v. Union of India</a> the Supreme Court has held that the right to know news and information regarding administration of the Government is included in the freedom of press. But this right is not absolute and restrictions can be imposed on it in the interest of the society and the individual from which the press obtains information. They can obtain information from an individual when he voluntarily agrees to give such information.<br class=\"akn-br\"/><br class=\"akn-br\"/>In <a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_1__ref_4\" data-href=\"https://indiankanoon.org/doc/125596/\" href=\"https://indiankanoon.org/doc/125596/\" id=\"part_III__sec_19__wrapup__p_1__ref_4\">Bennett Coleman &amp; Co v. Union of India (1972),</a> the Hon’ble Supreme Court held that the freedom of the press embodies the right of the people to free speech and expression. It was held that “Freedom of the press is both qualitative and quantitative. Freedom lies both in circulation and in content.”<br class=\"akn-br\"/><br class=\"akn-br\"/>In the case of <a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_1__ref_5\" data-href=\"https://indiankanoon.org/doc/110813550/\" href=\"https://indiankanoon.org/doc/110813550/\" id=\"part_III__sec_19__wrapup__p_1__ref_5\">Shreya Singhal v. Union of India, 2015</a> Section 66A of the Information Technology Act was challenged. Under this section, there were several arrests which were made due to which a wide outrage was seen in society. The petitioners said that this Article is infringing the Freedom of Speech and Expression. The Supreme Court stroked down this provision saying that this provision is too vague and prone to misuse.<br class=\"akn-br\"/><br class=\"akn-br\"/>In the <a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_1__ref_6\" data-href=\"https://indiankanoon.org/doc/438670/\" href=\"https://indiankanoon.org/doc/438670/\" id=\"part_III__sec_19__wrapup__p_1__ref_6\">State of U.P. v. Raj Narain (1975)</a>, the Supreme Court observed that the right to know is derived from the concept of freedom of speech. The Court further held that the people of this country have a right to know every public act, everything that is done in a public way, by their public functionaries.<br class=\"akn-br\"/><br class=\"akn-br\"/>Right to speak includes the right to not speak or the right to remain silent. In <a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_1__ref_7\" data-href=\"https://indiankanoon.org/doc/1508089/\" href=\"https://indiankanoon.org/doc/1508089/\" id=\"part_III__sec_19__wrapup__p_1__ref_7\">Bijoe Emmanuel v. State of Kerala (1986)</a>, the Supreme Court upheld the right to silence of three students who were expelled from school because they refused to sing the National Anthem. The Court held that no person can be compelled to sing the National Anthem if he has genuine conscientious objections based on his religious belief. Hence, the right to speak and the right to express includes the right not to express and to be silent.<br class=\"akn-br\"/><br class=\"akn-br\"/><b class=\"akn-b\">Freedom to Assemble Peacefully</b> - Article 19(1)(b) ensures the right to peacefully assemble and hold public meetings or processions without arms. This right allows citizens to come together for various purposes, such as protests, demonstrations, or discussions. However, reasonable restrictions can be imposed on this right in the interests of public order, sovereignty, and integrity of India.<br class=\"akn-br\"/><br class=\"akn-br\"/>In <a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_1__ref_8\" data-href=\"https://indiankanoon.org/doc/296985/\" href=\"https://indiankanoon.org/doc/296985/\" id=\"part_III__sec_19__wrapup__p_1__ref_8\">Himmat Lal v. Police Commissioner, Bombay (1972)</a>, the Supreme Court struck down a rule that empowered the police commissioner to impose a total ban on all public meetings and processions. It was held that the state could only make regulations in aid of the right of assembly of citizens and could impose reasonable restrictions in the interest of public order but no rule could be prescribed prohibiting all meetings or processions altogether.<br class=\"akn-br\"/><br class=\"akn-br\"/><b class=\"akn-b\">Freedom to Form Associations or Unions</b> -  Article 19(1)(c) guarantees the right to form associations or unions. Citizens have the freedom to form social, cultural, economic, or political associations or unions. This right allows individuals to collectively pursue common goals or interests. However, reasonable restrictions can be imposed on this right in the interests of public order, morality, or the sovereignty and integrity of India.<br class=\"akn-br\"/><br class=\"akn-br\"/>In <a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_1__ref_9\" data-href=\"https://indiankanoon.org/doc/1214330/\" href=\"https://indiankanoon.org/doc/1214330/\" id=\"part_III__sec_19__wrapup__p_1__ref_9\">Damyanti v. Union of India</a> (1971), the Supreme Court upheld the right of the members of an association to continue the association with its composition as voluntarily agreed upon by the persons forming the association.<br class=\"akn-br\"/><br class=\"akn-br\"/><b class=\"akn-b\">Freedom to Move Freely</b> -  Article 19(1)(d) ensures the right to move freely throughout the territory of India. Citizens have the liberty to move within the country, reside in any part of India, and settle in any place of their choice. However, reasonable restrictions can be imposed on this right in the interests of public order, security of the State, or the sovereignty and integrity of India.<br class=\"akn-br\"/><br class=\"akn-br\"/>In <a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_1__ref_10\" data-href=\"https://indiankanoon.org/doc/1266352/\" href=\"https://indiankanoon.org/doc/1266352/\" id=\"part_III__sec_19__wrapup__p_1__ref_10\">Chambara soy v. Union of India (2007),</a> some persons had blocked a road due to which the petitioner was delayed in taking his ailing son to the hospital and his son died on arrival at the hospital. The Supreme Court held that the right of the petitioner to move freely under Article 19(1)(d) has been violated due to the road blockage. The Court held that the State is liable to pay the compensation for the death of the petitioner’s son due to the inaction on the part of the State authorities in removing the aforesaid blockage.<br class=\"akn-br\"/><br class=\"akn-br\"/><b class=\"akn-b\">Freedom to Reside and Settle</b> - Article 19(1)(e) guarantees the right to reside and settle in any part of India. Citizens have the freedom to choose their place of residence and settle anywhere within the country. However, reasonable restrictions can be imposed on this right in the interests of public order, protection of scheduled tribes, or the sovereignty and integrity of India.<br class=\"akn-br\"/><br class=\"akn-br\"/>In the case of <a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_1__ref_11\" data-href=\"https://indiankanoon.org/doc/967399/\" href=\"https://indiankanoon.org/doc/967399/\" id=\"part_III__sec_19__wrapup__p_1__ref_11\">U.P. Avas Evam Vikas Parishad v. Friends Co-op. Housing Society Ltd.(1995)</a>, it was held by the Supreme Court that the right to residence under Article 19(1)(e) includes the right to shelter and to construct houses for that purpose.<br class=\"akn-br\"/><br class=\"akn-br\"/><b class=\"akn-b\">Freedom to Practice Profession, Occupation, Trade, or Business</b> -  Article 19(1)(g) provides the right to practice any profession, occupation, trade, or business. Citizens have the freedom to choose and engage in their preferred livelihoods. However, reasonable restrictions can be imposed on this right in the interests of the general public, professional qualifications, or the sovereignty and integrity of India.<br class=\"akn-br\"/><br class=\"akn-br\"/>In the landmark judgment, <a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_1__ref_12\" data-href=\"https://indiankanoon.org/doc/1256541/\" href=\"https://indiankanoon.org/doc/1256541/\" id=\"part_III__sec_19__wrapup__p_1__ref_12\">Chindamanrao v. State of M.P. (AIR 1951)</a>, the Central Provinces imposed a ban on the making of Bidis during the Agricultural Seasons. The manufacturing of Bidis used to work as an additional income for the women of the local area. So the act by the government of the Central province was challenged in the Supreme Court. Court decided that the act made by the government is arbitrary and does not fall under the reasonable restrictions.<br class=\"akn-br\"/><br class=\"akn-br\"/>The Hon’ble Supreme Court in<a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_1__ref_13\" data-href=\"https://indiankanoon.org/doc/1031794/\" href=\"https://indiankanoon.org/doc/1031794/\" id=\"part_III__sec_19__wrapup__p_1__ref_13\">Vishaka v. State of Rajasthan (1997)</a> has observed that the sexual harassment of working women in workplaces violates the fundamental right under Article 19(1)(g). In this case, comprehensive guidelines and binding directions were issued by the court to prevent the incidents of sexual harassment of women at workplaces in both public and private sectors.</span>]</span><span class=\"akn-p\">References</span><span class=\"akn-p\"><a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_3__ref_1\" data-href=\"https://indiankanoon.org/doc/1218090/\" href=\"https://indiankanoon.org/doc/1218090/\" id=\"part_III__sec_19__wrapup__p_3__ref_1\">IndianKanoon</a></span><span class=\"akn-p\"><a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_4__ref_1\" data-href=\"https://constitutionofindia.net/articles/article-19-protection-of-certain-rights-regarding-freedom-of-speech-etc/\" href=\"https://constitutionofindia.net/articles/article-19-protection-of-certain-rights-regarding-freedom-of-speech-etc/\" id=\"part_III__sec_19__wrapup__p_4__ref_1\">ConstitutionofIndia.net</a></span><span class=\"akn-p\"><a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_5__ref_1\" data-href=\"https://blog.ipleaders.in/article-19-indian-constitution/\" href=\"https://blog.ipleaders.in/article-19-indian-constitution/\" id=\"part_III__sec_19__wrapup__p_5__ref_1\">Blog Ipleaders</a> </span><span class=\"akn-p\"><a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_6__ref_1\" data-href=\"https://www.legalserviceindia.com/legal/article-7445-the-six-clauses-in-article-19.html\" href=\"https://www.legalserviceindia.com/legal/article-7445-the-six-clauses-in-article-19.html\" id=\"part_III__sec_19__wrapup__p_6__ref_1\">Legal Service India</a> </span><span class=\"akn-p\"><a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_7__ref_1\" data-href=\"https://en.wikipedia.org/wiki/Freedom_of_expression_in_India\" href=\"https://en.wikipedia.org/wiki/Freedom_of_expression_in_India\" id=\"part_III__sec_19__wrapup__p_7__ref_1\">Wikipedia</a></span><span class=\"akn-p\"><span class=\"akn-remark\" data-status=\"editorial\">[<b class=\"akn-b\">Editorial comment</b>-The Constitution (Sixteenth Amendment) Act, 1963, it amended the Clauses (2), (3), and (4) of Article 19. This was done to enable the state to make laws that, in the interests of the sovereignty and integrity of India, place reasonable restrictions on the enjoyment of the rights conferred by sub-clauses (a), (b), and (c) of clause 1 of the article.]</span></span><span class=\"akn-p\"><span class=\"akn-remark\" data-status=\"editorial\">[<b class=\"akn-b\">Editorial comment</b>-The Constitution (Ninety-seventh Amendment) Act, 2011,was proposed to overcome the difficulties faced by Cooperative societies and improve their performance and status in the country. The extensive establishment of cooperatives was envisioned as one of the attempts to achieve social and economic justice and the equitable distribution of the advantages of progress. According to this Amendment, these societies are given constitutional status and are legally protected while also maintaining their autonomous or democratic functioning. The Constitution was amended to require that the states guarantee the autonomy of cooperatives, and as a result, state governments are now required to support the voluntary formation, autonomous decision-making, democratic control, and operation of cooperatives. The Act witnessed many changes such as modification in Part III of Article 19(1)(c) with the insertion of the words “or co-operative societies”, and the addition of Article 43B (working towards enhancing the co-Operative Societies’ Voluntary formation, independent operation, and professional management) and Part IX B to the Indian Constitution. However, the 97th Amendment faced challenges in the High Court of Gujarat as the Parliament didn’t ask for approval from the state legislatures before passing the bill. The ratification/approval is necessary for matters concerning states and since the cooperative societies are a part of the state legislature, ratification was required. On July 20, 2021, the Supreme Court of India declared the 97th Amendment Act Unconstitutional. According to the Supreme Court ratification from states was necessary to pass the amendment which didn’t take place. The Supreme Court also said that the responsibility of Multistate Co-Operative societies is of the Centre while that of the State co-operative societies is of the state. As of the current scenario,  parts of the 97th Amendment on cooperatives are struck down.<a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_9__ref_1\" data-href=\"https://blog.examarly.com/upsc/97th-amendment-of-indian-constitution/\" href=\"https://blog.examarly.com/upsc/97th-amendment-of-indian-constitution/\" id=\"part_III__sec_19__wrapup__p_9__ref_1\">Also Refer</a>]</span></span><span class=\"akn-p\"><span class=\"akn-remark\" data-status=\"editorial\">[<b class=\"akn-b\">Editorial comment</b>-The Constitution (Forty-Fourth Amendment) Act, 1978, repealed Article 19 (1) (f) and also took out Article 31(1) has been taken out of Part III and made a separate Article 300A in Chapter IV of Part XII. This amendment may have taken away the scope of speedy remedy under Article 32 for the violation of Right to Property because it is no more a Fundamental Right. Making it a legal right under the Constitution serves two purposes: Firstly, it gives emphasis to the value of socialism included in the preamble and secondly, in doing so, it conformed to the doctrine of basic structure of the Constitution. <a class=\"akn-ref\" data-eid=\"part_III__sec_19__wrapup__p_10__ref_1\" data-href=\"https://en.wikipedia.org/wiki/Forty-fourth_Amendment_of_the_Constitution_of_India\" href=\"https://en.wikipedia.org/wiki/Forty-fourth_Amendment_of_the_Constitution_of_India\" id=\"part_III__sec_19__wrapup__p_10__ref_1\">Also Refer</a>]</span></span></span></section>",
    "numcites": 31,
    "numcitedby": 22221,
    "docid": 105344998,
    "docsource": "Constitution Article",
    "covers": [
      {
        "tid": 237570,
        "title": "Constitution"
      }
    ],
    "citetid": 1218090,
    "divtype": "akoma-ntoso",
    "relatedqs": [
      {
        "value": "defamation",
        "formInput": "defamation"
      },
      {
        "value": "article 19(1)(g)",
        "formInput": "article%2019%281%29%28g%29"
      },
      {
        "value": "article 19(2)",
        "formInput": "article%2019%282%29"
      },
      {
        "value": "sovereignty and integrity of india",
        "formInput": "sovereignty%20and%20integrity%20of%20india"
      },
      {
        "value": "freedom of speech",
        "formInput": "freedom%20of%20speech"
      },
      {
        "value": "97th amendment",
        "formInput": "97th%20amendment"
      },
      {
        "value": "article 19",
        "formInput": "article%2019"
      },
      {
        "value": "reasonable restriction",
        "formInput": "reasonable%20restriction"
      },
      {
        "value": "\"sovereignty and integrity\"",
        "formInput": "%22sovereignty%20and%20integrity%22"
      },
      {
        "value": "ratification",
        "formInput": "ratification"
      },
      {
        "value": "sovereignty",
        "formInput": "sovereignty"
      },
      {
        "value": "public order",
        "formInput": "public%20order"
      },
      {
        "value": "sovereignty and integrity",
        "formInput": "sovereignty%20and%20integrity"
      },
      {
        "value": "freedom of expression",
        "formInput": "freedom%20of%20expression"
      },
      {
        "value": "editorial",
        "formInput": "editorial"
      },
      {
        "value": "Article 19 1 g",
        "formInput": "Article%2019%201%20g"
      },
      {
        "value": "19 (1) g",
        "formInput": "19%20%281%29%20g"
      },
      {
        "value": "article 1",
        "formInput": "article%201"
      },
      {
        "value": " public rights",
        "formInput": "%20public%20rights"
      },
      {
        "value": "amendment of the constitution",
        "formInput": "amendment%20of%20the%20constitution"
      }
    ],
    "courtcopy": false,
    "query_alert": null,
    "agreement": false
  }